Autodesk.Navisworks.Api.Schema.VectorField
Represents the definition of a vector within a Autodesk.Navisworks.Api.Schema.SchemaDefinition.

Autodesk.Navisworks.Api.Schema.VectorField.#ctor(Autodesk.Navisworks.Api.Schema.Field)
Default constructor. No identifier specified.
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.#ctor(System.String,Autodesk.Navisworks.Api.Schema.Field)
Constructs the field with a given identifier.
Throws System.ArgumentException:
Provided field ID is invalid or missing. 7-bit ASCII without spaces must be used.
Throws System.ArgumentException:
Argument 'id' is not convertable to a 7-bit ASCII string
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.CollectionType
Represents collection metadata, including whether the collection is ordered, and whether the elements are unique.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.VectorField.GetCount(Autodesk.Navisworks.Api.Schema.ReadAccessor)
Obtains the number of values held within a distinct Autodesk.Navisworks.Api.Schema.SchemaData object.
accessor: Accessor provided by parent object e.g. from Autodesk.Navisworks.Api.Schema.SchemaData, or a containing VectorField's IndexAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaStorageNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.GetIndexAccessor(Autodesk.Navisworks.Api.Schema.EditAccessor,System.Int32)
Obtains the appropriate accessor for a given index into the vector.
accessor: Accessor provided by parent object e.g. from Autodesk.Navisworks.Api.Schema.SchemaData, or a containing VectorField's IndexAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaStorageNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.IndexOutOfRangeException:
An invalid index was passed.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.GetIndexAccessor(Autodesk.Navisworks.Api.Schema.ReadAccessor,System.Int32)
Obtains the appropriate accessor for a given index into the vector.
accessor: Accessor provided by parent object e.g. from Autodesk.Navisworks.Api.Schema.SchemaData, or a containing VectorField's IndexAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaStorageNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.IndexOutOfRangeException:
An invalid index was passed.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.VectorField.SetCount(Autodesk.Navisworks.Api.Schema.EditAccessor,System.Int32)
Sets the number of values held within a distinct Autodesk.Navisworks.Api.Schema.SchemaData object. Each index will be initialised to its default value.
accessor: Accessor provided by parent object e.g. from Autodesk.Navisworks.Api.Schema.SchemaData, or a containing VectorField's IndexAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaStorageNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed

Autodesk.Navisworks.Api.Schema.VectorField.ValueField
A field object that identifies the type used within the vector & provides access to each index.
Throws System.ObjectDisposedException:
Object has been Disposed